# Task Two : Calculate Summary statistics

# Importing libraries

In [1]:
import numpy as np
import pandas as pd

# Importing data

In [2]:
# load the data
df = pd.read_csv("New_train.csv")

In [3]:
# preview the data
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,S
1,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,S
2,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,S
3,6,0,3,"Moran, Mr. James",male,26,0,0,330877,8.4583,Q
4,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.0750,S

In [4]:
print("The shape of the DataFrame is = {}".format(df.shape))

The shape of the DataFrame is = (720, 11)

In [5]:
# check the column names   
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

In [6]:
df.set_index("PassengerId" , inplace=True  )

- I check column names and i put PassengerId as index because it unique values

In [7]:
# check data type
df.dtypes

Survived      int64
Pclass        int64
Name         object
Sex          object
Age           int64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Embarked     object
dtype: object

- I checked data types of columns and there aren't need any modification.

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 720 entries, 1 to 891
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  720 non-null    int64
 1   Pclass    720 non-null    int64
 2   Name      720 non-null    object
 3   Sex       720 non-null    object
 4   Age       720 non-null    int64
 5   SibSp     720 non-null    int64
 6   Parch     720 non-null    int64
 7   Ticket    720 non-null    object
 8   Fare      720 non-null    float64
 9   Embarked  720 non-null    object
dtypes: float64(1), int64(5), object(4)
memory usage: 61.9+ KB

- There are no  missing values

# We will check duplicate values

In [9]:
df.duplicated().sum()

0

- There are no duplicates values

# Descriptive Statistics Summary

In [10]:
df.describe().round(2)

       Survived  Pclass     Age   SibSp   Parch    Fare
count    720.00  720.00  720.00  720.00  720.00  720.00
mean       0.32    2.55   28.09    0.40    0.32   15.05
std        0.47    0.67   12.93    0.84    0.76    9.42
min        0.00    1.00    0.00    0.00    0.00    0.00
25%        0.00    2.00   21.00    0.00    0.00    7.88
50%        0.00    3.00   26.00    0.00    0.00   10.50
75%        1.00    3.00   34.00    1.00    0.00   23.00
max        1.00    3.00   80.00    4.00    5.00   42.40

# Calculate mean of our dataset

In [11]:
df.mean().round(3)

C:\Users\ZiaD\AppData\Local\Temp\ipykernel_11612\731755988.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean().round(3)

Survived     0.321
Pclass       2.554
Age         28.092
SibSp        0.399
Parch        0.324
Fare        15.053
dtype: float64

# Calculate median of our dataset¶

In [12]:
df.median()

C:\Users\ZiaD\AppData\Local\Temp\ipykernel_11612\530051474.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

Survived     0.0
Pclass       3.0
Age         26.0
SibSp        0.0
Parch        0.0
Fare        10.5
dtype: float64

# Calculate mode of our dataset¶

In [16]:
df.mode()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,0.0,3.0,"Abbing, Mr. Anthony",male,26.0,0.0,0.0,347082,8.05,S
1,NaN,NaN,"Abbott, Mr. Rossmore Edward",NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,"Abbott, Mrs. Stanton (Rosa Hunt)",NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,"Abelson, Mr. Samuel",NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,"Abelson, Mrs. Samuel (Hannah Wizosky)",NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
715,NaN,NaN,"de Mulder, Mr. Theodore",NaN,NaN,NaN,NaN,NaN,NaN,NaN
716,NaN,NaN,"de Pelsmaeker, Mr. Alfons",NaN,NaN,NaN,NaN,NaN,NaN,NaN
717,NaN,NaN,"del Carlo, Mr. Sebastiano",NaN,NaN,NaN,NaN,NaN,NaN,NaN
718,NaN,NaN,"van Billiard, Mr. Austin Blyler",NaN,NaN,NaN,NaN,NaN,NaN,NaN
719,NaN,NaN,"van Melkebeke, Mr. Philemon",NaN,NaN,NaN,NaN,NaN,NaN,NaN

# We have successfully Calculate mean , median , mode of our dataset

# GOOD LUCK !